Revit 2027 API
Element.Parameter(BuiltInParameter) Property
Retrieves a parameter from the element given a parameter id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Parameter this[
	BuiltInParameter parameterId
] { get; }
Public ReadOnly Property Parameter (
	parameterId As BuiltInParameter
) As Parameter
	Get
public:
property Parameter^ Parameter[BuiltInParameter parameterId] {
	Parameter^ get (BuiltInParameter parameterId);
}
member Parameter : Parameter with get
Parameters
parameterId BuiltInParameter
The built in parameter id of the parameter to be retrieved.
Property Value
Parameter
Remarks
Parameters are a generic form of data storage within elements. The parameters are visible through the Autodesk Revit user interface in the Element Properties dialog. This method uses a built in parameter id to access the parameter. Autodesk Revit has a large number of built in parameters that are available via an enumerated type.
Example
public Parameter FindWithBuiltinParameterID(Wall wall)
{
    //Use the WALL_BASE_OFFSET paramametId
    // to get the base offset parameter of the wall.
    BuiltInParameter paraIndex = BuiltInParameter.WALL_BASE_OFFSET;
    Parameter parameter = wall.get_Parameter(paraIndex);
    return parameter;
}
See Also
Reference
Element Class
Parameter Overload
Autodesk.Revit.DB Namespace